

//@-------------------------------------------------------------------------------------------------------------------
/**
* 概要 : 締め処理サブミット関数
*
* 対象 : 締め処理
*
* @param [objFrm]  : [オブジェクト型] . フォーム名
* @param [objFrom] : [オブジェクト型] . 入力フィールド名Ａ
* @param [objTo]   : [オブジェクト型] . 入力フィールド名Ｂ
*
* @event [onclick] : 対象オブジェクト
*/
//--------------------------------------------------------------------------------------------------------------------
function fncClosedSubmit( objFrm , objFrom , objTo )
{
	if( !( objFrom.value == '' || objTo.value == '' ) )
	{
		objFrm.submit();
	}
	return false;
}