<?
// ----------------------------------------------------------------------------
/**
*       キャッシュクラス
*
*
*       @package    K.I.D.S.
*       @license    http://www.kuwagata.co.jp/
*       @copyright  KUWAGATA CO., LTD.
*       @author     K.I.D.S. Groups <info@kids-groups.com>
*       @access     public
*       @version    2.00
*
*
*       処理概要
*   	キャッシュエリアに対してパラメータの指定により値を保持させる。
*   	又はパラメータの指定により値を取得する。
*
*       更新履歴
*
*/
// ----------------------------------------------------------------------------

class clsCache
{

	// ------------------------------------------------------------------------
	/**
	*	メンバー変数定義
	*
	*/
	// ------------------------------------------------------------------------
	var $m_aryMainCache;	// メインキャッシュエリア変数


	// ------------------------------------------------------------------------
	/*
	*
	*	概要：コンストラクタ
	*
	*	引数：なし
	*
	*	戻値：なし
	*
	*/
	// ------------------------------------------------------------------------
	function clsCache()
	{
		unset($this->m_aryMainCache);
	}

	// ------------------------------------------------------------------------
	/*
	*
	*	概要：パラメータに対する値の設定
	*
	*	引数：
	*		$strParam1	パラメータ１
	*		$strParam2	パラメータ２
	*		$strValue	値
	*
	*	戻値：true / false
	*/
	// ------------------------------------------------------------------------
	function SetValue( $strParam1, $strParam2, $strValue )
	{
		// キャッシュエリアに対してパラメータ指定部へ値を保持する。
		$this->m_aryMainCache[strval($strParam1)][strval($strParam2)] = $strValue;
		
		return true;
		
	}

	// ------------------------------------------------------------------------
	/*
	*
	*	概要：パラメータに対する値の取得
	*
	*	引数：
	*		$strParam1	パラメータ１
	*		$strParam2	パラメータ２
	*
	*	戻値：String値
	*/
	// ------------------------------------------------------------------------
	function GetValue( $strParam1, $strParam2 )
	{
		// キャッシュエリアが何も無い場合、空文字で返却
		if( !isset( $this->m_aryMainCache ) )
		{
			return "";
		}

		// キャッシュエリア（パラメータ指定部）が何も無い場合、空文字で返却
		if( !isset( $this->m_aryMainCache[strval($strParam1)][strval($strParam2)] ) )
		{
			return "";
		}

		// 指定のキャッシュエリア値を返却
		return $this->m_aryMainCache[strval($strParam1)][strval($strParam2)];
	}

	// ------------------------------------------------------------------------
	/*
	*
	*	概要：キャッシュエリア値全ての取得
	*
	*	引数：なし
	*
	*	戻値：キャッシュエリア値（2次元配列）
	*/
	// ------------------------------------------------------------------------
	function GetAllValue()
	{
		return $this->m_aryMainCache;
	}
	

	//-------------------------------------------
	/*
	*
	* キャッシュエリアの開放処理
	*
	*/
	//-------------------------------------------
	function Release()
	{
		unset($this->m_aryMainCache);
	}
}

?>
